src/cf/Catalogs/узКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>узКонфигурации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолучатьИзмененияИзХранилища</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение1с</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогТранзитнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательТранзитнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяВТранзитнуюБазу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАльтернативнуюЗагрузкуДанныхИзХранилища</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьФайлЛистЗадачВКаталогеЛокальногоРепозитория</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляВыгрузкиФайлаЛистаЗадач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеныКомментарииБезЗадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>узФормироватьФайлСОтборомПоКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасширение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеДляКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСервернаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узКонфигурации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ПроверитьРеквизиты(Отказ);
		
	Если Отказ Тогда
		Возврат;
	Конецесли;
КонецПроцедуры

Процедура ПроверитьРеквизиты(Отказ)
	МассивПроверяемыхРеквизитов = ПолучитьМассивПроверяемыхРеквизитов();
	Для каждого ИмяРеквизита из МассивПроверяемыхРеквизитов цикл
		ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
		Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка! не заполнен реквизит ["+ИмяРеквизита+"]";
			Сообщение.Поле = "Объект."+ИмяРеквизита;
			Сообщение.Сообщить();
			Отказ = Истина;
		Конецесли;
	Конеццикла;
КонецПроцедуры 

Функция ПолучитьМассивПроверяемыхРеквизитов() Экспорт 
	МассивПроверяемыхРеквизитов = Новый Массив();
	Если НЕ ЭтоГруппа 
		И ПолучатьИзмененияИзХранилища Тогда
		
		// +++ 79Vlad  10.10.2018
		Если НЕ ИспользоватьАльтернативнуюЗагрузкуДанныхИзХранилища Тогда
			//Нет необходимости в заполнении данных параметров
			// --- 79Vlad  10.10.2018			
			МассивПроверяемыхРеквизитов.Добавить("Приложение1с");
			МассивПроверяемыхРеквизитов.Добавить("КаталогТранзитнойБазы");
			МассивПроверяемыхРеквизитов.Добавить("ПользовательТранзитнойБазы");
			МассивПроверяемыхРеквизитов.Добавить("ПарольПользователяВТранзитнуюБазу");
			МассивПроверяемыхРеквизитов.Добавить("ПользовательХранилища");
			МассивПроверяемыхРеквизитов.Добавить("ПарольПользователяВХранилище");
			// +++ 79Vlad  10.10.2018
		КонецЕсли; 
		// --- 79Vlad  10.10.2018
		
		//+ #198 Иванов А.Б. 2020-05-23 
		Если ЭтоРасширение Тогда
			МассивПроверяемыхРеквизитов.Добавить("ИмяРасширения");
			МассивПроверяемыхРеквизитов.Добавить("РасширениеДляКонфигурации");
		Конецесли;
		//- #198 Иванов А.Б. 2020-05-23 
		
		
		
		МассивПроверяемыхРеквизитов.Добавить("КаталогХранилища");
		
	Конецесли;
	Возврат МассивПроверяемыхРеквизитов; 
КонецФункции
